Tekla Open API Reference for Tekla Structures 2025
RebarItem.TIE_STIRRUP_USAGE Field
 The tie/stirrup usage string.
 Namespace: Tekla.Structures.Catalogs
 Assembly: Tekla.Structures.Catalogs (in Tekla.Structures.Catalogs.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public const string TIE_STIRRUP_USAGE = "tie/stirrup"
Public Const TIE_STIRRUP_USAGE As String = "tie/stirrup"
Field Value
Type: String
See Also
Reference
RebarItem Class
Tekla.Structures.Catalogs Namespace